package com.example.vortex.qr_quest;

/*各ステージごとの問題データ*/
public class Qr_Quest_Data {
    int questNumber = 0;
    boolean quest_answer[] = {false,false,false,false,false,false,false,false,false,false};

    String qr_data[] = {
            "54985",
            "56710",
            "59587",
            "15124",
            "46638",
            "20885",
            "45876",
            "35099",
            "36694",
            "23769",
    };

    String quest_data[] = {
            "前田、大島、渡辺を代表とした数々の選手がこのポジションを争った",
            "４２３０１３０\n数字以外の言い方で読んでみると？人の名前が？その人を訪ねましょう",
            "血が出て女性騒いでいる野球のポジションは？",
            "エビが美味しい地名を名前に持つ人を訪ねよ！",
            "１→１０→???→５→４\n???に入る数字のポジションは？",
            "第一関門のように見えて，実は第二関門である場所でQRコードを探せ！",
            "遊んでないのに遊んでると言われてしまうポジションは？",
            "並び変えるとデブになってしまう呪文となる場所でQRコードを探せ！",
            "ナイターの時に目立つポジションとなる場所でQRコードを探せ！",
            "ピッチャーとキャッチャーで、かっこ悪い方のポジションとなる場所でQRコードを探せ！",
    };

    String qr_quest_data[] = {
            "(株)NTTデータフロンティアの創立記念日は？",
            "1234 + 766 = ???",
            "平成最後の日は？",
            "2×2×2×2×2×2×2×2×2×2＝？",
            "高い順に並び替えなさい。\n" +
                    "1.泉谷さん\n" +
                    "2.スカイツリー\n" +
                    "3.名古屋テレビ塔\n" +
                    "4.東京タワー",
            "いいはこつくろう鎌倉幕府。鎌倉幕府ができた年は？\n※2018年現在の歴史鑑定の結果を回答してください。",
            "しぶさわを数字にすると？？？",
            "若い順に並び替えなさい。\n" +
                    "1.狩生慎吾\n" +
                    "2.株式会社NTTデータフロンティア\n" +
                    "3.iphone\n" +
                    "4.ロマネコンティ1945",
            "このゲームの主催者（内山）の誕生日は？",
            "今日は何月何日？mmddの形式で答えよ．",
    };

    String qr_quest_answer[] = {

            "0901",
            "2000",
            "0430",
            "1024",
            "2431",
            "1185",
            "4230",
            "3124",
            "0131",
            "0915",
    };

}
